const body = {
  type: '0',             // '且-0 ｜ 或-1'
  'inboundForm': {
    '天数': '15',
    'type': '入账笔数',   // 入账笔数,入账金额
    '运算符': '大于',     // 大于，小于，。。。。
    'value': 'xxxx'     // 金额或者number
  },
  'inboundTo': {
    '天数': '15',
    'type': '入账笔数',   // 入账笔数,入账金额
    '运算符': '大于',     // 大于，小于，。。。。
    'value': 'xxxx'     // 金额或者number
  }
}

const data = {
  '流失客户': 2000,     // 潜在流失客户，流失客户，自定义
  '客户占比': '10%',    // 客户占比
  'KYC': 111,          // 潜在流失客户数/KYC完成客户数
  'queryTime': 12345,  // 查询时间（时间戳）
  '分类': [
    {
      name: '档口客户', // 名称
      count: 20,      // 数量
      key: 'type1'    // 唯一值
    },
    {
      name: '外贸SOHZO',  // 名称
      count: 20,         // 数量
      key: 'type2'       // 唯一值
    }
  ],
  '图表数据': {
    'key1-销售区域': {
      xAxis: ['大连1组', '大连2组', '宁波1组', '宁波2组'],
      data: [
        {
          '类型': '档口',
          count: [200, 350, 550, 400]
        },
        {
          '类型': '全部',
          count: [1000, 1000, 2000, 3000]
        }
      ]
    },
    'key2-来源渠道': {
      xAxis: ['ICBU', '老客户', '自己注册', '销售渠道'],
      data: [
        {
          '类型': '全部',
          count: [300, 700, 800, 700]
        }
      ]
    },
    'key3-累计入账金额': {
      xAxis: ['5w', '1-2w', '3-5w', '5-10w'],
      data: [
        {
          '类型': '档口',
          count: [200, 350, 550, 400]
        },
        {
          '类型': '外贸',
          count: [100, 350, 250, 300],
          xAxis: ['1w以内', '1-2w', '3-5w', '5-10w']
        },
        {
          '类型': '全部',
          count: [300, 700, 800, 700],
          xAxis: ['1w以内', '1-2w', '3-5w', '5-10w']
        }
      ]
    },
    'key4-累计入账次数': {
      xAxis: ['1w以内', '1-2w', '3-5w', '5-10w'],
      data: [
        {
          '类型': '档口',
          count: [200, 350, 550, 400]
        },
        {
          '类型': '外贸',
          count: [100, 350, 250, 300]
        },
        {
          '类型': '全部',
          count: [300, 700, 800, 700]
        }
      ]
    },
    'key5-平均入账金额': {
      xAxis: ['1w以内', '1-2w', '3-5w', '5-10w'],
      data: [
        {
          '类型': '档口',
          count: [200, 350, 550, 400]
        },
        {
          '类型': '外贸',
          count: [100, 350, 250, 300]
        },
        {
          '类型': '全部',
          count: [300, 700, 800, 700]
        }
      ]
    }
  }
}


// 搜索组件
